const localCards = {
  "1": {
    category: "صح ولا هبد",
    q1: "دييغو مارادونا سجل هدفه الشهير با ايده في نهائي كأس العالم", a1: "هبد (ربع نهائي)", p1: "1 نقطة",
    q2: "زين الدين زيدان حصل على الكرة الذهبية أكثر من مرة", a2: "هبد (مره)", p2: "1 نقطة",
    q3: "أول كأس العالم كانت سنة 1930", a3: "صح", p3: "1 نقطة"
  },
  "2": {
    category: "صح ولا هبد",
    q1: "إنتر ميلان لم يهبط إلى الدرجة الثانية في تاريخه", a1: "صح", p1: "1 نقطة",
    q2: "بايرن ميونخ فاز بدوري أبطال أوروبا موسم 2012", a2: "هبد (خسر)", p2: "1 نقطة",
    q3: "تييري هنري هو الهداف التاريخي لنادي أرسنال", a3: "صح", p3: "1 نقطة"
  },
  "3": {
    category: "صح ولا هبد",
    q1: "رونالدينيو لعب لنادي ميلان قبل برشلونة", a1: "هبد (العكس)", p1: "1 نقطة",
    q2: "يوفنتوس لم يهبط في تاريخه", a2: "هبد (هبط 2006)", p2: "1 نقطة",
    q3: "محمد صلاح فاز بالحذاء الذهبي في الدوري الإنجليزي مرتين", a3: "هبد ( 3)", p3: "1 نقطة"
  },
  "4": {
    category: "صح ولا هبد",
    q1: "الاهلي اول نادي مصري يفوز بدوري ابطال افريقيا", a1: "هبد (الاسماعيلي)", p1: "1 نقطة",
    q2: "الزمالك فاز بكأس الكونفدرالية 2019", a2: "صح", p2: "1 نقطة",
    q3: "حسام حسن هو الهداف التاريخي لمنتخب مصر", a3: "صح", p3: "1 نقطة"
  },
  "5": {
    category: "صح ولا هبد",
    q1: "ليونيل ميسي هو أكثر لاعب تحقيقاً للألقاب الجماعية في تاريخ كرة القدم", a1: "صح", p1: "1 نقطة",
    q2: "الأهلي فاز بالبرونزية في كأس العالم للأندية 2020", a2: "صح", p2: "1 نقطة",
    q3: "شيكابالا لعب لنادي سبورتنج لشبونة", a3: "صح", p3: "1 نقطة"
  },
  "6": {
    category: "صح ولا هبد",
    q1: "السويدي زلاتان إبراهيموفيتش فاز بلقب دوري أبطال أوروبا", a1: "هبد", p1: "1 نقطة",
    q2: "نيمار انتقل لباريس مقابل 200 مليون يورو", a2: "هبد (222)", p2: "1 نقطة",
    q3: "بايرن ميونخ حقق الثلاثية 2013", a3: "صح", p3: "1 نقطة"
  },
  "7": {
    category: "صح ولا هبد",
    q1: "مانشستر سيتي فاز بدوري الأبطال لأول مرة 2022", a1: "هبد (2023)", p1: "1 نقطة",
    q2: "تشيلسي فاز بدوري الأبطال مرتين", a2: "صح", p2: "1 نقطة",
    q3: "رونالدينيو فاز بالكرة الذهبية", a3: "صح", p3: "1 نقطة"
  },
  "8": {
    category: "صح ولا هبد",
    q1: "كريستيانو رونالدو هو أول لاعب في التاريخ يسجل في 5 نسخ مختلفة من كأس العالم", a1: "صح", p1: "1 نقطة",
    q2: "مارادونا فاز بكأس العالم 1982", a2: "هبد (1986)", p2: "1 نقطة",
    q3: "فاز مالديني بكأس العالم ودوري ابطال أوروبا", a3: "هبد (لم يفز بكاس عالم)", p3: "1 نقطة"
  },
  "9": {
    category: "صح ولا هبد",
    q1: "لويس سواريز فاز بجائزة الحذاء الذهبي الأوروبي مرتين", a1: "صح", p1: "1 نقطة",
    q2: "سيرجيو راموس سجل أهدافاً في نهائي دوري أبطال أوروبا أكثر من واين روني", a2: "صح", p2: "1 نقطة",
    q3: "اول نادي مصري تأسس في مصر كان السكة الحديد", a3: "صح", p3: "1 نقطة"
  },
  "10": {
    category: "صح ولا هبد",
    q1: "مانشستر يونايتد لم يخسر أبداً أي مباراة على ملعبه (أولد ترافورد) في الدوري الإنجليزي وهو متقدم في الشوط الأول", a1: "صح", p1: "1 نقطة",
    q2: "ريال مدريد لم يسبق له الفوز بلقب \"كأس ملك إسبانيا\" و \"دوري أبطال أوروبا\" في نفس الموسم إلا في عام 2014", a2: "صح", p2: "1 نقطة",
    q3: "لويس إنريكي، مدرب برشلونة السابق، كان لاعباً في صفوف ريال مدريد لمدة 5 سنوات قبل انتقاله للبارسا", a3: "صح", p3: "1 نقطة"
  },
  "11": {
    category: "صح ولا هبد",
    q1: "سانتياجو برنابيو (الذي سُمي الملعب باسمه) كان لاعباً ومدرباً ورئيساً لنادي ريال مدريد", a1: "صح", p1: "1 نقطة",
    q2: "ريال مدريد فاز بلقب دوري أبطال أوروبا 5 مرات متتالية", a2: "صح", p2: "1 نقطة",
    q3: "النجم ليونيل ميسي سجل أول \"هاتريك\" في مسيرته الاحترافية ضد نادي ريال مدريد", a3: "صح", p3: "1 نقطة"
  },
  "12": {
    category: "صح ولا هبد",
    q1: "في قانون كرة القدم، إذا تم تنفيذ ضربة جزاء واصطدمت بالقائم ثم ارتدت للاعب الذي سددها وسجلها دون أن تلمس أحداً غيره, يُلغى الهدف", a1: "صح", p1: "1 نقطة",
    q2: "واين روني هو اللاعب الوحيد في تاريخ الدوري الإنجليزي الذي سجل أكثر من ٢٠٠ هدف وصنع أكثر من ١٠٠ هدف", a2: "صح", p2: "1 نقطة",
    q3: "رونالدو الظاهرة سجل في جميع مباريات البرازيل في كأس العالم ٢٠٠٢ من الافتتاح حتى النهائي", a3: "غلط", p3: "1 نقطة"
  },
  "13": {
    category: "صح ولا هبد",
    q1: "جوزيه مورينيو فاز بلقب دوري أبطال أوروبا مع نادي تشيلسي الإنجليزي", a1: "هبد", p1: "1 نقطة",
    q2: "ريال مدريد فاز بكل المباريات النهائية التي تأهل إليها في تاريخ دوري أبطال أوروبا", a2: "هبد (خسر 3 نهائيات)", p2: "1 نقطة",
    q3: "كيليان مبابي هو أصغر لاعب في التاريخ يسجل هدفاً في نهائي كأس العالم", a3: "هبد (17 هدف)", p3: "1 نقطة"
  },
  "14": {
    category: "صح ولا هبد",
    q1: "كيليان مبابي هو أصغر لاعب في التاريخ يسجل هدفاً في نهائي كأس العالم", a1: "هبد (بيليه)", p1: "1 نقطة",
    q2: "أسرع كارت أحمر في تاريخ كأس العالم كان من نصيب لاعب حصل عليه بعد 10 ثوانٍ فقط", a2: "هبد (54 ثانيه)", p2: "1 نقطة",
    q3: "ميروسلاف كلوزه هو أكثر لاعب سجل أهدافاً في \"نسخة واحدة\" من كأس العالم", a3: "هبد", p3: "1 نقطة"
  },
  "15": {
    category: "صح ولا هبد",
    q1: "الظاهرة رونالدو (البرازيلي) فاز بلقب دوري أبطال أوروبا", a1: "هبد", p1: "1 نقطة",
    q2: "ليونيل ميسي سجل أهدافاً في كل دقيقة من دقائق المباراة (من الدقيقة 1 إلى 90)", a2: "هبد", p2: "1 نقطة",
    q3: "منتخب إنجلترا فاز بلقب اليورو (بطولة أمم أوروبا) مرة واحدة", a3: "هبد (ولا مره)", p3: "1 نقطة"
  },
  "16": {
    category: "أسئلة عامة",
    q1: "من صاحب أسرع هدف في تاريخ الدوري المصري", a1: "ياو انور", p1: "1 نقطة",
    q2: "من هداف الدوري المصري عبر التاريخ", a2: "حسن الشاذلي", p2: "2 نقطة",
    q3: "من أول فريق فاز بالدوري المصري", a3: "الأهلي", p3: "3 نقاط"
  },
  "17": {
    category: "أسئلة عامة",
    q1: "كم مرة حصل الترجي على دوري أبطال أفريقيا", a1: "4", p1: "1 نقطة",
    q2: "من هو صاحب أسرع هاترك في الدوري الإنجليزي الممتاز", a2: "ماني", p2: "2 نقطة",
    q3: "من أكثر لاعب لعب مباريات في تاريخ الدوري الإنجليزي الممتاز 653 مباراة", a3: "جاريث باري", p3: "3 نقاط"
  },
  "18": {
    category: "أسئلة عامة",
    q1: "أي فريق فاز بلقب الدوري الإنجليزي الممتاز النسخة الأولى", a1: "مانشستر يونايتد", p1: "1 نقطة",
    q2: "من هم اللاعبين الثلاثة الذين تشاركوا في الحذاء الذهبي في الدوري الإنجليزي الممتاز موسم 2018-2019", a2: "صالح- ماني – اوباميانج", p2: "2 نقطة",
    q3: "أي بلد فاز بأول كأس عالم في عام ١٩٣٠", a3: "اوروجواي", p3: "3 نقاط"
  },
  "19": {
    category: "أسئلة عامة",
    q1: "من البلد التي شاركت في ثلاث نهائيات لكأس العالم لكنها لم تفز", a1: "هولندا", p1: "1 نقطة",
    q2: "في أي بطولة كأس عالم سجل فيها دييغو مارادونا هدفه الشهير باليد", a2: "1986 المكسيك", p2: "2 نقطة",
    q3: "فاز ثلاثة أشخاص بكأس العالم كلاعب ومدرب. ماريو زاجالو وديدييه ديشامب ... هل يمكنك تسمية الثالث", a3: "فرانز بيكنباور", p3: "3 نقاط"
  },
  "20": {
    category: "أسئلة عامة",
    q1: "فاز لاعبان إنجليزيان بالحذاء الذهبي لكأس العالم من هما", a1: "جاري لينيكر و هاري كين", p1: "1 نقطة",
    q2: "قضى ميسي مسيرته المهنية الكاملة في برشلونة ، ولكن ما هو فريقه عندما كان تلميذ", a2: "نيولز اولد بويز", p2: "2 نقطة",
    q3: "اعتزل ميسي دوليًا بشكل مشهور في أي عام قبل عكس قراره", a3: "2016 بعد خسارة الكوبا", p3: "3 نقاط"
  },
  "21": {
    category: "أسئلة عامة",
    q1: "من هو اللاعب الوحيد الذي فاز بدوري ابطال أوروبا مع ثلاث فرق مختلفة", a1: "سيدورف مع اياكس – ميلان -ريال مدريد", p1: "1 نقطة",
    q2: "من هو الفريق الأول من المملكة المتحدة الذي فاز بكأس أوروبا", a2: "سيلتيك", p2: "2 نقطة",
    q3: "كم فريق انجليزي فاز بدوري الأبطال", a3: "6", p3: "3 نقاط"
  },
  "22": {
    category: "أسئلة عامة",
    q1: "فاز فريق من رومانيا بدوري أبطال أوروبا مرة واحدة فقط. يمكنك تسميته", a1: "ستيوا بوخارست", p1: "1 نقطة",
    q2: "من هو أكثر لاعب سجل في نسخة واحدة من كأس أمم أوروبا", a2: "بالتيني في يورو 84", p2: "2 نقطة",
    q3: "من سجل الهدف الذهبي لفرنسا في إيطاليا في يورو 2000", a3: "ديفيد تريزيجيه", p3: "3 نقاط"
  },
  "23": {
    category: "أسئلة عامة",
    q1: "من هو هداف منتخب إنجلترا في اليورو", a1: "الان شيرار", p1: "1 نقطة",
    q2: "أي من هذه المنتخبات لم يفز بكأس أمم أوروبا من قبل: الدنمارك، بلجيكا واليونان", a2: "بلجيكا", p2: "2 نقطة",
    q3: "هل يمكنك تسمية أكثر لاعب شارك مع منتخب ألمانيا عبر التاريخ", a3: "لوثر ماتيوس", p3: "3 نقاط"
  },
  "24": {
    category: "أسئلة عامة",
    q1: "العمر القياسي لأصغر مدرب في الدوري الألماني هو 28 عاماً و 205 يوماً. من كان", a1: "يوليان ناجيلسمان", p1: "1 نقطة",
    q2: "فازت ألمانيا بكأس العالم أربع مرات، ولكن كم مرة فعلت ذلك كدولة موحدة", a2: "مرة في 2014", p2: "2 نقطة",
    q3: "فقط ثلاثة أندية ألمانية فازت بكأس أوروبا / دوري أبطال أوروبا. من هم", a3: "بايرن ميونخ – بوروسيا دورتموند – هامبورج", p3: "3 نقاط"
  },
  "25": {
    category: "أسئلة عامة",
    q1: "من المعروف أن مانشستر يونايتد يرتدي اللون الأحمر، ولكن ما هي الألوان التي ارتداها قبل اعتماد اللون الأحمر", a1: "الأخضر والأصفر", p1: "1 نقطة",
    q2: "متى فازت مصر بأول بطولة كأس أمم إفريقيا", a2: "1957", p2: "2 نقطة",
    q3: "من هو صاحب أول هدف مصري في كأس العالم", a3: "عبدالرحمن فوزي", p3: "3 نقاط"
  },
  "26": {
    category: "أسئلة عامة",
    q1: "أكثر حارس حافظ على نظافة شباكه في مباريات متتالية في مصر", a1: "ثابت البطل", p1: "1 نقطة",
    q2: "من هو أكثر لاعب سجل اهداف في مباراة القمة بين الأهلي والزمالك", a2: "عبد الكريم صقر 17 هدف", p2: "2 نقطة",
    q3: "من هو اللاعب الذي سجل هدف تأهل مصر لكأس العالم 1990 في مرمى الجزائر", a3: "حسام حسن", p3: "3 نقاط"
  },
  "27": {
    category: "أسئلة عامة",
    q1: "من اول نادي فرنسي فاز بدوري الأبطال", a1: "مارسيليا", p1: "1 نقطة",
    q2: "من هو أول حارس مرمى فاز بالكرة الذهبية", a2: "ياشين", p2: "2 نقطة",
    q3: "ما هو النادي الذي لعب له رونالدينيو قبل برشلونة مباشرة", a3: "باريس سانت جيرمان", p3: "3 نقاط"
  },
  "28": {
    category: "أسئلة عامة",
    q1: "من هو أول لاعب أفريقي فاز بالكرة الذهبية", a1: "جورج وياه", p1: "1 نقطة",
    q2: "من هو اللاعب الذي أضاع ركلة الجزاء الحاسمة في نهائي كأس العالم 1994", a2: "باجيو", p2: "2 نقطة",
    q3: "من هو أول نادي إنجليزي فاز بدوري أبطال أوروبا", a3: "مانشستر يونايتد", p3: "3 نقاط"
  },
  "29": {
    category: "أسئلة عامة",
    q1: "من هو أول لاعب عربي فاز بدوري أبطال أوروبا", a1: "رابح ماجر", p1: "1 نقطة",
    q2: "من هو النادي الأكثر فوزاً بكأس الاتحاد الإنجليزي", a2: "ارسنال", p2: "2 نقطة",
    q3: "من اخر لاعب فاز بالكرة الذهبية من الدوري الإنجليزي", a3: "كريستيانو رونالدو", p3: "3 نقاط"
  },
  "30": {
    category: "أسئلة عامة",
    q1: "من هو اللاعب الذي فاز بالكرة الذهبية ثلاث مرات متتالية", a1: "بالتيني", p1: "1 نقطة",
    q2: "كام مرة الأهلي والزمالك لعبوا بعض في بطولة دوري أبطال أفريقيا", a2: "9", p2: "2 نقطة",
    q3: "من هو أكثر لاعب مشاركة في تاريخ يوفنتوس", a3: "ديل بيرو", p3: "3 نقاط"
  },
  "31": {
    category: "مين أقرب",
    q1: "كم اسيست صنعه ميسي في الدوري الاسباني", a1: "192", p1: "1 نقطة",
    q2: "كم عدد مباريات كافو مع منتخب البرازيل", a2: "142", p2: "2 نقطة",
    q3: "كم عدد أهداف عماد متعب في الدوري المصري", a3: "75", p3: "3 نقاط"
  },
  "32": {
    category: "مين أقرب",
    q1: "كم مرة توقف الدوري المصري", a1: "10", p1: "1 نقطة",
    q2: "كم مرة شارك الأهلي في دوري ابطال افريقيا", a2: "31", p2: "2 نقطة",
    q3: "عدد اهداف وسام أبو علي مع الأهلي", a3: "38", p3: "3 نقاط"
  },
  "33": {
    category: "مين أقرب",
    q1: "كم عدد أهداف واين روني مع مانشستر يونايتد", a1: "253", p1: "1 نقطة",
    q2: "عدد اهداف لويس سواريز", a2: "600", p2: "2 نقطة",
    q3: "محمد أبو تريكه كم هدف سجل في مسيرته", a3: "189", p3: "3 نقاط"
  },
  "34": {
    category: "مين أقرب",
    q1: "جيانلويجي بوفون حافظ علي نظافه شباكه في كم مباراة", a1: "501", p1: "1 نقطة",
    q2: "كم عدد أهداف تييري هنري في الدوري الإنجليزي", a2: "175", p2: "2 نقطة",
    q3: "كم ثانية استغرقها أسرع هدف في تاريخ كأس العالم، والذي سجله التركي هكان شكور عام 2002 في مرمى كوريا الجنوبية", a3: "11 ثانية", p3: "3 نقاط"
  },
  "35": {
    category: "مين أقرب",
    q1: "كم عدد المباريات المتتالية التي خاضها ريال مدريد بدون هزيمة في كل البطولات ليفوز برقم قياسي إسباني (تحت قيادة زيدان)؟", a1: "40", p1: "1 نقطة",
    q2: "كم عدد الأهداف التي سجلها محمود الخطيب (بيبو) طوال مسيرته في بطولة الدوري المصري الممتاز؟", a2: "109", p2: "2 نقطة",
    q3: "كم عدد الأهداف الإجمالية التي شهدتها بطولة كأس العالم قطر 2022 بأكملها (والتي اعتبرت الأكثر غزارة تهديفية في التاريخ)؟", a3: "172", p3: "3 نقاط"
  },
  "36": {
    category: "المزاد",
    q1: "فرق من الدوري الإيطالي (اخرك 20)", a1: "المزاد", p1: "1 نقطة",
    q2: "فرق فازت بدوري الأبطال (24)", a2: "المزاد", p2: "2 نقطة",
    q3: "لعيبة من التوب 6 في الدوري الإنجليزي الموسم ده", a3: "المزاد", p3: "3 نقاط"
  },
  "37": {
    category: "المزاد",
    q1: "فرق من الدوري المصري", a1: "المزاد", p1: "1 نقطة",
    q2: "فرق من الدوري الاسباني", a2: "المزاد", p2: "2 نقطة",
    q3: "فرق من الدوري الإنجليزي", a3: "المزاد", p3: "3 نقاط"
  },
  "38": {
    category: "المزاد",
    q1: "لعيبة من برشلونة وريال مدريد الموسم ده", a1: "المزاد", p1: "1 نقطة",
    q2: "لعيبة كسبت كاس العالم ودوري الأبطال", a2: "المزاد", p2: "2 نقطة",
    q3: "فرق فازت بدوري ابطال افريقيا (26)", a3: "المزاد", p3: "3 نقاط"
  },
  "39": {
    category: "المزاد",
    q1: "لعيبة لعبت نهائي القرن في دوري ابطال افريقيا 2020", a1: "المزاد", p1: "1 نقطة",
    q2: "لعيبة سجلت في ماتشات القمة ما بين الأهلي والزمالك", a2: "المزاد", p2: "2 نقطة",
    q3: "لعيبة فازت بالكرة الذهبية", a3: "المزاد", p3: "3 نقاط"
  },
  "40": {
    category: "المزاد",
    q1: "اذكر منتخبات وصلت لنص نهائي كاس العالم", a1: "المزاد", p1: "1 نقطة",
    q2: "منتخبات مشاركة في كاس عالم 2026", a2: "المزاد", p2: "2 نقطة",
    q3: "لعيبة لعبت في اهلي والزمالك", a3: "المزاد", p3: "3 نقاط"
  }
};
